# Используем образ с полным .NET SDK, так как он нужен для сборки в рантайме
FROM mcr.microsoft.com/dotnet/sdk:6.0

# Устанавливаем git
RUN apt-get update && apt-get install -y git

# Создаем и устанавливаем рабочую директорию
WORKDIR /app

# Копируем все файлы из локального контекста сборки в контейнер.
# Это включает и папку .git, что позволяет entrypoint.sh делать git pull.
COPY . .

# Копируем скрипт запуска в контейнер
RUN chmod +x entrypoint.sh

# Копируем конфигурационные файлы, чтобы они были в контексте сборки
# Этот шаг теперь не обязателен, так как `COPY . .` уже все скопировал,
# но оставим для ясности, что эти файлы важны.
COPY lint-rules.json .
COPY commands.json .
COPY environments.json .

# Открываем порт, который будет слушать приложение
EXPOSE 80

# Устанавливаем наш скрипт как точку входа.
# Он будет выполняться каждый раз при запуске контейнера.
ENTRYPOINT ["./entrypoint.sh"] 